In [1]:
pip install MySQL-connector-python

Requirement already satisfied: MySQL-connector-python in c:\users\vivek\anaconda3\lib\site-packages (8.0.32)
Requirement already satisfied: protobuf<=3.20.3,>=3.11.0 in c:\users\vivek\anaconda3\lib\site-packages (from MySQL-connector-python) (3.20.3)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import mysql.connector
from mysql.connector import Error
import pandas as pd

In [6]:
def create_server_connection(host_name,user_name,user_password):
    global connection
    connection = None
    try:
        connection = mysql.connector.connect(host = host_name,user = user_name,password= user_password)
        print("My Connection Successful")
    except Error as er:
        print(f" Error : {er}")
    return connection
ps = "Iwish@12345"
db = "project1"

create_server_connection("localhost","root",ps)

My Connection Successful

In [9]:
def create_database(connection,query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        print("Database created Successfully")
    except Error as er:
        print(f" Error : {er}")
query1 = "create database project1"
create_database(connection,query1)

 Error : 1007 (HY000): Can't create database 'project1'; database exists

In [11]:
def create_db_connection(host_name,user_name,user_password,db_name):
    connection = None
    try:
        connection = mysql.connector.connect(host=host_name,user=user_name,password=user_password,database=db_name)
        print("Database connection successfully")
    except Error as er:
        print(f" Error :{er}")
    return connection

In [23]:
global cursor
def execute_query(connection,query):
    cursor=connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("Query was successful")
        
    except Error as er:
        print(f" Error :{er}")

In [27]:
create_table_student="""
CREATE TABLE student
(roll_no INT,student_name VARCHAR(30),father_name VARCHAR(30),class VARCHAR(20),dob DATE,gender VARCHAR(20),
mobile_no VARCHAR(20));
"""

connection = create_db_connection("localhost","root",ps,db)
execute_query(connection,create_table_student)

Database connection successfully
 Error :1050 (42S01): Table 'student' already exists

In [28]:
insert_student="""
INSERT INTO student VALUES
(1,"mayank verma","hari verma","third","20.05.2010","male","8696931112"),
(2,"priyanshu","madan lal","third","05.09.2010","male","8696931756"),
(3,"anshika","anuj gupta","third","27.03.2010","female","8696931632"),
(4,"aarav","rajbir singh","third","02.02.2010","male","8696931489");
"""
connection = create_db_connection("localhost","root",ps,db)
execute_query(connection,insert_student)

Database connection successfully
Query was successful

In [37]:
def read_query(connection,query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as er:
        print(f" Error : {er}")

In [38]:
Q1 = """
select * from student;
"""

connection = create_db_connection("localhost","root",ps,db)
results = read_query(connection,Q1)

from_db =[]

for result in results:
    result = list(result)
    from_db.append(result)
columns = ["roll_no","student_name","father_name","class","dob","gender","mobile_no"]

df = pd.DataFrame(from_db, columns = columns)
display(df)

Database connection successfully

   roll_no  student_name   father_name  class         dob  gender   mobile_no
0        1  mayank verma    hari verma  third  2020-05-20    male  8696931112
1        2     priyanshu     madan lal  third  2005-09-20    male  8696931756
2        3       anshika    anuj gupta  third  2027-03-20  female  8696931632
3        4         aarav  rajbir singh  third  2002-02-20    male  8696931489

In [41]:
# Deleting a row from table

Q2 ="""
delete from student where roll_no=2;
"""             
connection = create_db_connection("localhost","root",ps,db)
execute_query(connection,Q2)

Database connection successfully
Query was successful

In [44]:
Q1 = """
select * from student;
"""

connection = create_db_connection("localhost","root",ps,db)
results = read_query(connection,Q1)

from_db =[]

for result in results:
    result = list(result)
    from_db.append(result)
columns = ["roll_no","student_name","father_name","class","dob","gender","mobile_no"]

df = pd.DataFrame(from_db, columns = columns)
display(df)

Database connection successfully

   roll_no  student_name   father_name  class         dob  gender   mobile_no
0        1  mayank verma    hari verma  third  2020-05-20    male  8696931112
1        3       anshika    anuj gupta  third  2027-03-20  female  8696931632
2        4         aarav  rajbir singh  third  2002-02-20    male  8696931489

In [45]:
# Updating the record
Q3 ="""
update student set father_name="ranjit singh" where roll_no=4;
""" 
connection = create_db_connection("localhost","root",ps,db)
execute_query(connection,Q3)

Database connection successfully
Query was successful

In [47]:
Q1 = """
select * from student;
"""

connection = create_db_connection("localhost","root",ps,db)
results = read_query(connection,Q1)

from_db =[]

for result in results:
    result = list(result)
    from_db.append(result)
columns = ["roll_no","student_name","father_name","class","dob","gender","mobile_no"]

df = pd.DataFrame(from_db, columns = columns)
display(df)

Database connection successfully

   roll_no  student_name   father_name  class         dob  gender   mobile_no
0        1  mayank verma    hari verma  third  2020-05-20    male  8696931112
1        3       anshika    anuj gupta  third  2027-03-20  female  8696931632
2        4         aarav  ranjit singh  third  2002-02-20    male  8696931489

In [52]:
# fetching a record with some condition

Q4 ="select * from student where gender='male';"

connection = create_db_connection("localhost","root",ps,db)
results = read_query(connection,Q4)

from_db =[]

for result in results:
    result = list(result)
    from_db.append(result)
columns = ["roll_no","student_name","father_name","class","dob","gender","mobile_no"]

df = pd.DataFrame(from_db, columns = columns)
display(df)

Database connection successfully

   roll_no  student_name   father_name  class         dob gender   mobile_no
0        1  mayank verma    hari verma  third  2020-05-20   male  8696931112
1        4         aarav  ranjit singh  third  2002-02-20   male  8696931489

In [53]:
# inserting more values
insert_student="""
INSERT INTO student VALUES
(5,"nishant","vikash soni","third","10.01.2010","male","8696931753"),
(2,"priyanshu","madan lal","third","05.09.2010","male","8696931756"),
(3,"vanshika","siddhatha namdev","third","27.09.2010","female","8696931159"),
(4,"anuraj","kapil sen","third","30.11.2010","male","8696931731");
"""
connection = create_db_connection("localhost","root",ps,db)
execute_query(connection,insert_student)

Database connection successfully
Query was successful

In [55]:
Q5 ="select * from student order by student_name;"

connection = create_db_connection("localhost","root",ps,db)
results = read_query(connection,Q5)

from_db=[]
for result in results:
    result=list(result)
    from_db.append(result)
columns = ["roll_no","student_name","father_name","class","dob","gender","mobile_no"]
df = pd.DataFrame(from_db,columns=columns)
display(df)

Database connection successfully

,roll_no,student_name,father_name,class,dob,gender,mobile_no
0,4,aarav,ranjit singh,third,2002-02-20,male,8696931489
1,3,anshika,anuj gupta,third,2027-03-20,female,8696931632
2,4,anuraj,kapil sen,third,2030-11-20,male,8696931731
3,1,mayank verma,hari verma,third,2020-05-20,male,8696931112
4,5,nishant,vikash soni,third,2010-01-20,male,8696931753
5,2,priyanshu,madan lal,third,2005-09-20,male,8696931756
6,3,vanshika,siddhatha namdev,third,2027-09-20,female,8696931159

In [56]:
Q3 ="""
update student set roll_no=6 where student_name='vanshika';
""" 
connection = create_db_connection("localhost","root",ps,db)
execute_query(connection,Q3)

Database connection successfully
Query was successful

In [58]:
Q3 ="""
update student set roll_no=7 where student_name='anuraj';
""" 
connection = create_db_connection("localhost","root",ps,db)
execute_query(connection,Q3)

Database connection successfully
Query was successful

In [60]:
#fectching records order by

Q5 ="select * from student order by roll_no;"

connection = create_db_connection("localhost","root",ps,db)
results = read_query(connection,Q5)

from_db=[]
for result in results:
    result=list(result)
    from_db.append(result)
columns = ["roll_no","student_name","father_name","class","dob","gender","mobile_no"]
df = pd.DataFrame(from_db,columns=columns)
display(df)

Database connection successfully

,roll_no,student_name,father_name,class,dob,gender,mobile_no
0,1,mayank verma,hari verma,third,2020-05-20,male,8696931112
1,2,priyanshu,madan lal,third,2005-09-20,male,8696931756
2,3,anshika,anuj gupta,third,2027-03-20,female,8696931632
3,4,aarav,ranjit singh,third,2002-02-20,male,8696931489
4,5,nishant,vikash soni,third,2010-01-20,male,8696931753
5,6,vanshika,siddhatha namdev,third,2027-09-20,female,8696931159
6,7,anuraj,kapil sen,third,2030-11-20,male,8696931731